app/views/admin/items/edit.html.erb

        <td>ジャンル</td>
        <td><%= f.select :genre_id, options_from_collection_for_select(Genre.all, :id, :name) %></td>
---
SELECT "genres".* FROM "genres"