app/views/admin/items/new.html.erb

SELECT "genres".* FROM "genres"
---
      <td>ジャンル</td>
      <td><%= f.select :genre_id, options_from_collection_for_select(Genre.all, :id, :name), { include_blank: '-- 選択してください --'} %></td>