app/controllers/admin/genres_controller.rb

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "genres" SET "name" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["name", "ぷりん"], ["updated_at", "2021-11-03 15:04:39.584871"], ["id", 1]]
---
  def update
    @genre = Genre.find(params[:id])
    @genre.update(genre_params)