app/controllers/admin/items_controller.rb

  def index
    @items = Item.page(params[:page]).per(10)
---
SELECT  "items".* FROM "items" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items"

  def create
    @item = Item.new(item_params)
    @item.save
---
INSERT INTO "items" ("genre_id", "name", "image_id", "introduction", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @item = Item.find(params[:id])
    @item.update(item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "image_id" = ?, "is_active" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["image_id", "45284907bcef6c2e63ef61227659f604d9a228f2ab9cc06869917d60e6fd"], ["is_active", 0], ["updated_at", "2021-11-06 05:23:49.989438"], ["id", 1]]