app/controllers/admin/order_details_controller.rb

  def update
    @order_detail = OrderDetail.find(params[:id])
    @order_detail.update(order_detail_params)
    if @order_detail.making == "production"
      @order_detail.order.update(status: "production")
    end
    @order = @order_detail.order
    sum = 0
    @order.order_details.each do |order_detail|
      if order_detail.making == "completion"
        sum += 1
      end
    end
    if @order.order_details.count == sum
      @order_detail.order.update(status: "ready")
---
SELECT  "order_details".* FROM "order_details" WHERE "order_details"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", 2], ["updated_at", "2021-11-09 13:00:06.946788"], ["id", 19]]
UPDATE "order_details" SET "making" = ?, "updated_at" = ? WHERE "order_details"."id" = ?  [["making", 2], ["updated_at", "2021-11-07 15:35:25.444742"], ["id", 9]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 19]]
SELECT COUNT(*) FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 19]]
UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", 3], ["updated_at", "2021-11-09 13:20:08.842995"], ["id", 19]]