app/views/admin/orders/show.html.erb

      <%= form_with model: [:admin, @order], local:true do |f| %>
      <td><%= f.select :status, Order.statuses_i18n.invert %><%= f.submit "更新" %></td>
---
SELECT "orders".* FROM "orders"

        <%= form_with model: [:admin, @order], local:true do |f| %>
        <%= f.select :making, OrderDetail.makings_i18n.invert %>
---
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 13]]