app/controllers/public/addresses_controller.rb

  def create
    @address = current_customer.addresses.new(address_params)
    @address.save
---
INSERT INTO "addresses" ("customer_id", "name", "postal_code", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["customer_id", 4], ["name", "櫻井薫"], ["postal_code", "4444444"], ["address", "愛知県名古屋市1-2-3"], ["created_at", "2021-11-07 14:22:31.124050"], ["updated_at", "2021-11-07 14:22:31.124050"]]

  def update
    @address = Address.find(params[:id])
    @address.update(address_params)
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "addresses" SET "name" = ?, "updated_at" = ? WHERE "addresses"."id" = ?  [["name", "田中光太郎"], ["updated_at", "2021-10-23 11:28:09.071777"], ["id", 1]]