app/controllers/public/cart_items_controller.rb

SELECT "cart_items".* FROM "cart_items"
SELECT "items".* FROM "items"
SELECT SUM(subtotal) FROM "cart_items"
---
  def index
    @cart_items = CartItem.all

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ? AND "cart_items"."item_id" = ? LIMIT ?  [["customer_id", 4], ["item_id", 12], ["LIMIT", 1]]
UPDATE "cart_items" SET "amount" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["amount", 9], ["updated_at", "2021-11-07 15:17:33.078885"], ["id", 29]]
INSERT INTO "cart_items" ("item_id", "customer_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["item_id", 5], ["customer_id", 2], ["amount", 6], ["created_at", "2021-10-28 13:06:13.255451"], ["updated_at", "2021-10-28 13:06:13.255451"]]
---
  def create
    @cart_item = CartItem.new(cart_item_params)
    @cart_item.customer_id = current_customer.id
    @cart_item_find = current_customer.cart_items.find_by(item_id: params[:cart_item][:item_id])
    if @cart_item_find
      @cart_item_find.update(amount: @cart_item_find.amount + (params[:cart_item][:amount].to_i))
    else
      @cart_item.save

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "cart_items" SET "amount" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["amount", 5], ["updated_at", "2021-11-01 14:04:13.491888"], ["id", 17]]
---
  def update
    @cart_item = CartItem.find(params[:id])
    @cart_item.update(cart_item_params)

DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 26]]
---
  def destroy_all
    CartItem.destroy_all