app/controllers/public/customers_controller.rb

  def update
    @customer = current_customer
    @customer.update(customer_params)
---
UPDATE "customers" SET "last_name" = ?, "first_name" = ?, "last_name_kana" = ?, "first_name_kana" = ?, "postal_code" = ?, "address" = ?, "telephone_number" = ?, "email" = ?, "updated_at" = ? WHERE "customers"."id" = ?

  def withdraw
    @customer = current_customer
    @customer.update(is_active: false)
---
UPDATE "customers" SET "is_active" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["is_active", 0], ["updated_at", "2021-11-07 15:40:34.783120"], ["id", 4]]