app/controllers/public/items_controller.rb

SELECT  "items".* FROM "items" ORDER BY "items"."created_at" DESC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @items = Item.all