app/controllers/public/orders_controller.rb

  def index
    @orders = current_customer.orders
---
SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = ?  [["customer_id", 4]]