app/controllers/public/orders_controller.rb

  def comfirm
    @cart_items = CartItem.all
    @order = Order.new(order_params)
    @order.shipping_cost = 800
    if params[:order][:address_select] == "a"
      @order.postal_code = current_customer.postal_code
      @order.address = current_customer.address
      @order.name = current_customer.last_name + current_customer.first_name
    elsif params[:order][:address_select] == "b"
      @address = Address.find(params[:order][:address_id])
---
SELECT "cart_items".* FROM "cart_items"
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1234567], ["LIMIT", 1]]
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
    @order = Order.new(order_params)
    @order.status = 0
    @order.customer_id = current_customer.id
    @order.save
    @cart_items = CartItem.all
    @cart_items.each do |cart_item|
      order_detail = OrderDetail.new
      order_detail.amount = cart_item.amount
      order_detail.item_id = cart_item.item_id
      order_detail.order_id = @order.id
      order_detail.making = 0
      order_detail.price = cart_item.item.price
      order_detail.save
     end
    CartItem.destroy_all
---
INSERT INTO "orders" ("customer_id", "name", "postal_code", "address", "shipping_cost", "total_payment", "payment_method", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "cart_items".* FROM "cart_items"
INSERT INTO "order_details" ("item_id", "order_id", "price", "amount", "making", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["item_id", 1], ["order_id", 13], ["price", 300], ["amount", 2], ["making", 0], ["created_at", "2021-10-31 12:36:18.068394"], ["updated_at", "2021-10-31 12:36:18.068394"]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 15]]

  def index
    @orders = Order.all
    @order_details = OrderDetail.all
---
SELECT "orders".* FROM "orders"
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]

  def show
    @order = Order.find(params[:id])
    @order_details = OrderDetail.all
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 14]]