app/views/public/orders/new.html.erb

SELECT "addresses".* FROM "addresses" WHERE "addresses"."customer_id" = ?  [["customer_id", 4]]
---
    <%= f.label :address_id, "登録済住所から選択" %><br>
    <%= f.select :address_id, options_from_collection_for_select(current_customer.addresses, :id, :full_address) %>